Revit 2027 API
AnnotationFamilyUtils.HasLeaderSnapReference Method
 Checks if the element supports the LEADER_SNAP_REFERENCE parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasLeaderSnapReference(
	Element element
)
Public Shared Function HasLeaderSnapReference (
	element As Element
) As Boolean
public:
static bool HasLeaderSnapReference(
	Element^ element
)
static member HasLeaderSnapReference :
        element : Element -> bool
Parameters
element Element
 The element to check.
Return Value
Boolean
 True if the element has the LEADER_SNAP_REFERENCE parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only some elements in annotation families have the LEADER_SNAP_REFERENCE parameter.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace